/**==================================================================================================================
 **【文件名称】  main.c
 **【功能测试】  LED流水灯_简单的延时函数
 **==================================================================================================================
 **【实验平台】  STM32F407 + KEIL5.27
 **
 **【实验操作】  USB线，插到开发板CMSIS-DAP接口上;
 **              因使用的是板载的LED，因而无需其它接线及器材;
 **              点击软件左上角的编译，编译无错后，点击LOAD，即可烧录至开发板;
 **
 **【划 重 点】  红色LED，已连接芯片的PC5引脚，置低电平可通路;
 **              蓝色LED，已连接芯片的PB2引脚，置低电平可通路;
 **              本延时函数，适用168MHz系统时钟环境，以及打勾Options/ c++ / One ELF Section per Function这一选项;
 **              本延时函数，非准确延时; 且受中断因素等影响。
 **
 **【更新记录】  2022-08-28  完善代码结构、注释
 **              2022-08-27  创建
 **
 **【备注说明】  版权归魔女科技所有，请勿商用，谢谢！
 **              https://demoboard.taobao.com
====================================================================================================================*/
#include "stm32f4xx.h"
#include "bsp_led.h"



static void delay_ms(uint32_t ms)                     // 定义一个ms延时函数，减少移植时对外部文件依赖; 本函数仅作粗略延时使用，而并非精准延时;
{
    ms = ms * 42001;                                  // 注意：此参考值运行条件：打勾 Options/ c++ / One ELF Section per Function
    for (uint32_t i = 0; i < ms; i++);                // 注意系统时钟下，大约多少个空循环耗时1ms
}



int main(void)
{
    Led_Init();                                       // 初始化LED所用端口、引脚工作模式
    LED_RED_ON;                                       // 点亮红色LED; 本语句是bsp_led.h中的一个宏定义; 这样的写法，能大幅简化代码量，及提高代码可读性;
    LED_BLUE_ON;                                      // 点亮蓝色LED; 

    while (1)                                         // while函数死循环；作用：不能让main函数运行结束，否则会产生硬件错误
    {
        delay_ms(1500);                                // 延时
        LED_RED_ON;                                   // 点亮LED_RED， 低电平点亮; 宏定义，在bsp_led.h中定义
        LED_BLUE_OFF;                                 // 熄灭LED_BLUE: 高电平熄灭; 宏定义，在bsp_led.h中定义
                
        delay_ms(1500);                                // 延时
        GPIO_SetBits(LED_RED_GPIO, LED_RED_PIN);      // 熄灭LED_RED， 高电平熄灭; 库函数操作
        GPIO_ResetBits(LED_BLUE_GPIO, LED_BLUE_PIN);  // 点亮LED_BLUE，低电平点亮; 库函数操作
    }
}


// 每个代码文件的末尾，注意要加两个空行

